series

In [77]:
import pandas as pd

In [78]:
series1=pd.Series([10,20,30,40], index=['a','b','c','d'])
print("Series1 \n:",series1)

Series1
: a    10
b    20
c    30
d    40
dtype: int64

In [79]:
print("\nValue at index 'b' :",series1['b'])
print("Value at position 2:", series1.iloc[2])

series2=series1*2
print(series2)

Value at index 'b' : 20
Value at position 2: 30
a    20
b    40
c    60
d    80
dtype: int64

dataframe

In [80]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35],
    'City': ['New York', 'London', 'Paris']
}

df=pd.DataFrame(data,index=['x','y','z'])
print("Dataframe: ")
print(df)
print("Name Column:")
print(df['Name'])

print("Rows with index 'Y' :")
print(df.loc['y'])

print("\nAge of 'z':", df.loc['z', 'Age'])
print("\nColumns:", df.columns)
print("Shape:", df.shape)

Dataframe:
      Name  Age      City
x    Alice   25  New York
y      Bob   30    London
z  Charlie   35     Paris
Name Column:
x      Alice
y        Bob
z    Charlie
Name: Name, dtype: object
Rows with index 'Y' :
Name       Bob
Age         30
City    London
Name: y, dtype: object

Age of 'z': 35

Columns: Index(['Name', 'Age', 'City'], dtype='object')
Shape: (3, 3)

In [81]:
series=pd.Series([1,2,3], index=(['first', 'second', 'third']))
print(series)
print("Access the second element : ",series.iloc[2])
print(series*10)

df={
    'Product':['hats','cycle','pen'],
    'Price':[10,200,5],
    'Quantity':[23,55,66]
}
df=pd.DataFrame(df)

print("Access the first row :",df.loc[0])
print("the second column",df['Price'])

first     1
second    2
third     3
dtype: int64
Access the second element :  3
first     10
second    20
third     30
dtype: int64
Access the first row : Product     hats
Price         10
Quantity      23
Name: 0, dtype: object
the second column 0     10
1    200
2      5
Name: Price, dtype: int64

In [82]:
df=pd.read_csv("student_data.csv")

In [83]:
df

   ID     Name   Age Grade  Subject  Score
0   1    Alice  20.0     A     Math   85.0
1   2      Bob   NaN     B  Science   78.0
2   3  Charlie  19.0     C     Math    NaN
3   4    David  21.0     A  English   92.0
4   5      Eve  20.0   NaN  Science   88.0
5   6    Frank  22.0     B     Math   75.0
6   7    Grace  19.0     A  English    NaN
7   8   Hannah   NaN     C  Science   80.0
8   9      Ivy  20.0     B     Math   90.0
9  10     Jack  21.0     A  English   87.0

In [84]:
df.head(3)

   ID     Name   Age Grade  Subject  Score
0   1    Alice  20.0     A     Math   85.0
1   2      Bob   NaN     B  Science   78.0
2   3  Charlie  19.0     C     Math    NaN

In [85]:
df.tail(2)

   ID  Name   Age Grade  Subject  Score
8   9   Ivy  20.0     B     Math   90.0
9  10  Jack  21.0     A  English   87.0

In [86]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 6 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   ID       10 non-null     int64
 1   Name     10 non-null     object
 2   Age      8 non-null      float64
 3   Grade    9 non-null      object
 4   Subject  10 non-null     object
 5   Score    8 non-null      float64
dtypes: float64(2), int64(1), object(3)
memory usage: 612.0+ bytes

In [87]:
df.describe()

             ID        Age      Score
count  10.00000   8.000000   8.000000
mean    5.50000  20.250000  84.375000
std     3.02765   1.035098   6.069538
min     1.00000  19.000000  75.000000
25%     3.25000  19.750000  79.500000
50%     5.50000  20.000000  86.000000
75%     7.75000  21.000000  88.500000
max    10.00000  22.000000  92.000000

In [88]:
df.shape

(10, 6)

In [89]:
df.columns

Index(['ID', 'Name', 'Age', 'Grade', 'Subject', 'Score'], dtype='object')

In [90]:
df.index

RangeIndex(start=0, stop=10, step=1)

In [91]:
df.isnull().sum()

ID         0
Name       0
Age        2
Grade      1
Subject    0
Score      2
dtype: int64

In [92]:
df.count()

ID         10
Name       10
Age         8
Grade       9
Subject    10
Score       8
dtype: int64

In [93]:
df['Subject'].value_counts()

Subject
Math       4
Science    3
English    3
Name: count, dtype: int64

data selection and Indexing in Pandas

In [94]:
df

   ID     Name   Age Grade  Subject  Score
0   1    Alice  20.0     A     Math   85.0
1   2      Bob   NaN     B  Science   78.0
2   3  Charlie  19.0     C     Math    NaN
3   4    David  21.0     A  English   92.0
4   5      Eve  20.0   NaN  Science   88.0
5   6    Frank  22.0     B     Math   75.0
6   7    Grace  19.0     A  English    NaN
7   8   Hannah   NaN     C  Science   80.0
8   9      Ivy  20.0     B     Math   90.0
9  10     Jack  21.0     A  English   87.0

In [95]:
df['Name']

0      Alice
1        Bob
2    Charlie
3      David
4        Eve
5      Frank
6      Grace
7     Hannah
8        Ivy
9       Jack
Name: Name, dtype: object

In [96]:
print(df[['Name','Score']].head())

      Name  Score
0    Alice   85.0
1      Bob   78.0
2  Charlie    NaN
3    David   92.0
4      Eve   88.0

In [97]:
print(df.loc[2])

ID               3
Name       Charlie
Age           19.0
Grade            C
Subject       Math
Score          NaN
Name: 2, dtype: object

In [98]:
print(df.iloc[2,1])

Charlie

In [99]:
print(df.loc[0:3,['Name','Subject']])

      Name  Subject
0    Alice     Math
1      Bob  Science
2  Charlie     Math
3    David  English

In [100]:
print(df[df['Score']>80])

   ID   Name   Age Grade  Subject  Score
0   1  Alice  20.0     A     Math   85.0
3   4  David  21.0     A  English   92.0
4   5    Eve  20.0   NaN  Science   88.0
8   9    Ivy  20.0     B     Math   90.0
9  10   Jack  21.0     A  English   87.0

In [101]:
print(df[(df['Subject']=='Math')&(df['Grade']=='A')])

   ID   Name   Age Grade Subject  Score
0   1  Alice  20.0     A    Math   85.0

In [102]:
print(df.query('Age>=20'))

   ID   Name   Age Grade  Subject  Score
0   1  Alice  20.0     A     Math   85.0
3   4  David  21.0     A  English   92.0
4   5    Eve  20.0   NaN  Science   88.0
5   6  Frank  22.0     B     Math   75.0
8   9    Ivy  20.0     B     Math   90.0
9  10   Jack  21.0     A  English   87.0

In [103]:
print(df.at[4,'Score'])

88.0

In [104]:
print(df.iat[2,1])

Charlie

In [105]:
'''Create a new DataFrame containing only the Name, Subject, and Score columns for students who are either in the Science subject or have a Score greater than or equal to 85. How would you combine these conditions, and what is the shape of the resulting DataFrame?'''
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'Age': [20, 21, 19, 22, 20],
    'Subject': ['Math', 'Science', 'History', 'English', 'Biology'],
    'Score': [85, 90, 78, 92, 88]
}
df=pd.DataFrame(data)


print(df[(df['Subject']=='Science')|(df['Score']>=85)])
df.shape

    Name  Age  Subject  Score
0  Alice   20     Math     85
1    Bob   21  Science     90
3  David   22  English     92
4    Eva   20  Biology     88

(5, 4)

In [106]:
print(df[(df['Subject']=='Science')|(df['Score']>=85)])

    Name  Age  Subject  Score
0  Alice   20     Math     85
1    Bob   21  Science     90
3  David   22  English     92
4    Eva   20  Biology     88

In [107]:
df.shape

(5, 4)

Data Cleaning in Pandas

In [108]:
df=pd.read_csv("student_data.csv")

In [109]:
print(df.isnull().sum())

ID         0
Name       0
Age        2
Grade      1
Subject    0
Score      2
dtype: int64

In [110]:
mean_age = df['Age'].mean()
new_df=df.copy()
new_df['Age'] = new_df['Age'].fillna(mean_age)

print(new_df['Age'].isnull().sum())  # Should be 0
print(new_df.head())

0
   ID     Name    Age Grade  Subject  Score
0   1    Alice  20.00     A     Math   85.0
1   2      Bob  20.25     B  Science   78.0
2   3  Charlie  19.00     C     Math    NaN
3   4    David  21.00     A  English   92.0
4   5      Eve  20.00   NaN  Science   88.0

In [111]:
print(df.duplicated().sum())

0

In [112]:
print(df.duplicated(subset=['Name']).sum())

0

In [113]:
print(df.dtypes)

ID           int64
Name        object
Age        float64
Grade       object
Subject     object
Score      float64
dtype: object

In [114]:
df['Grade']=df['Grade'].astype('category')

In [115]:
print(df.dtypes)

ID            int64
Name         object
Age         float64
Grade      category
Subject      object
Score       float64
dtype: object

In [116]:
print(df['Score'])

0    85.0
1    78.0
2     NaN
3    92.0
4    88.0
5    75.0
6     NaN
7    80.0
8    90.0
9    87.0
Name: Score, dtype: float64

In [117]:
df['Score']=pd.to_numeric(df['Score'],errors='coerce')

In [118]:
print(new_df['Score'].isnull().sum())  # Check missing values
print(new_df['Score'].dtype)  # Check data type
print(new_df[['Name', 'Score']])

2
float64
      Name  Score
0    Alice   85.0
1      Bob   78.0
2  Charlie    NaN
3    David   92.0
4      Eve   88.0
5    Frank   75.0
6    Grace    NaN
7   Hannah   80.0
8      Ivy   90.0
9     Jack   87.0

In [119]:
new_df1=df.copy()

In [120]:
print(new_df1)

   ID     Name   Age Grade  Subject  Score
0   1    Alice  20.0     A     Math   85.0
1   2      Bob   NaN     B  Science   78.0
2   3  Charlie  19.0     C     Math    NaN
3   4    David  21.0     A  English   92.0
4   5      Eve  20.0   NaN  Science   88.0
5   6    Frank  22.0     B     Math   75.0
6   7    Grace  19.0     A  English    NaN
7   8   Hannah   NaN     C  Science   80.0
8   9      Ivy  20.0     B     Math   90.0
9  10     Jack  21.0     A  English   87.0

In [121]:
new_df1['Grade'] = new_df1['Grade'].replace('C', 'Average')
print(new_df1['Grade'].value_counts())  # Verify replacement
print(new_df1.head())


new_df2 = df.copy()
# Since 'Grade' is a categorical column, we need to add 'Unknown' to its categories before filling NA
if 'Unknown' not in new_df2['Grade'].cat.categories:
    new_df2['Grade'] = new_df2['Grade'].cat.add_categories(['Unknown'])
new_df2['Grade'] = new_df2['Grade'].fillna('Unknown')
print(new_df2['Grade'].isnull().sum())  # Verify no missing values
print(new_df2[['Name', 'Grade']])

Grade
A          4
B          3
Average    2
Name: count, dtype: int64
   ID     Name   Age    Grade  Subject  Score
0   1    Alice  20.0        A     Math   85.0
1   2      Bob   NaN        B  Science   78.0
2   3  Charlie  19.0  Average     Math    NaN
3   4    David  21.0        A  English   92.0
4   5      Eve  20.0      NaN  Science   88.0
0
      Name    Grade
0    Alice        A
1      Bob        B
2  Charlie        C
3    David        A
4      Eve  Unknown
5    Frank        B
6    Grace        A
7   Hannah        C
8      Ivy        B
9     Jack        A

C:\Users\ATHARV\AppData\Local\Temp\ipykernel_2932\4026553102.py:1: FutureWarning: The behavior of Series.replace (and DataFrame.replace) with CategoricalDtype is deprecated. In a future version, replace will only be used for cases that preserve the categories. To change the categories, use ser.cat.rename_categories instead.
  new_df1['Grade'] = new_df1['Grade'].replace('C', 'Average')

In [122]:
df2=df.copy()

In [123]:
df2

   ID     Name   Age Grade  Subject  Score
0   1    Alice  20.0     A     Math   85.0
1   2      Bob   NaN     B  Science   78.0
2   3  Charlie  19.0     C     Math    NaN
3   4    David  21.0     A  English   92.0
4   5      Eve  20.0   NaN  Science   88.0
5   6    Frank  22.0     B     Math   75.0
6   7    Grace  19.0     A  English    NaN
7   8   Hannah   NaN     C  Science   80.0
8   9      Ivy  20.0     B     Math   90.0
9  10     Jack  21.0     A  English   87.0

In [124]:
df2['Pass']=df['Score']>=80

In [125]:
df2

   ID     Name   Age Grade  Subject  Score   Pass
0   1    Alice  20.0     A     Math   85.0   True
1   2      Bob   NaN     B  Science   78.0  False
2   3  Charlie  19.0     C     Math    NaN  False
3   4    David  21.0     A  English   92.0   True
4   5      Eve  20.0   NaN  Science   88.0   True
5   6    Frank  22.0     B     Math   75.0  False
6   7    Grace  19.0     A  English    NaN  False
7   8   Hannah   NaN     C  Science   80.0   True
8   9      Ivy  20.0     B     Math   90.0   True
9  10     Jack  21.0     A  English   87.0   True

In [126]:
new_df2=df.drop(columns=['Age'])

In [127]:
new_df2

   ID     Name Grade  Subject  Score
0   1    Alice     A     Math   85.0
1   2      Bob     B  Science   78.0
2   3  Charlie     C     Math    NaN
3   4    David     A  English   92.0
4   5      Eve   NaN  Science   88.0
5   6    Frank     B     Math   75.0
6   7    Grace     A  English    NaN
7   8   Hannah     C  Science   80.0
8   9      Ivy     B     Math   90.0
9  10     Jack     A  English   87.0

In [128]:
df=df.sort_values('Score')
df

   ID     Name   Age Grade  Subject  Score
5   6    Frank  22.0     B     Math   75.0
1   2      Bob   NaN     B  Science   78.0
7   8   Hannah   NaN     C  Science   80.0
0   1    Alice  20.0     A     Math   85.0
9  10     Jack  21.0     A  English   87.0
4   5      Eve  20.0   NaN  Science   88.0
8   9      Ivy  20.0     B     Math   90.0
3   4    David  21.0     A  English   92.0
2   3  Charlie  19.0     C     Math    NaN
6   7    Grace  19.0     A  English    NaN

In [129]:
df_sorted=df.sort_values(['Score','Subject'],ascending=[False,True])

df_sorted

   ID     Name   Age Grade  Subject  Score
3   4    David  21.0     A  English   92.0
8   9      Ivy  20.0     B     Math   90.0
4   5      Eve  20.0   NaN  Science   88.0
9  10     Jack  21.0     A  English   87.0
0   1    Alice  20.0     A     Math   85.0
7   8   Hannah   NaN     C  Science   80.0
1   2      Bob   NaN     B  Science   78.0
5   6    Frank  22.0     B     Math   75.0
6   7    Grace  19.0     A  English    NaN
2   3  Charlie  19.0     C     Math    NaN

In [130]:
new_df = df.copy()

# Handle missing Score values (e.g., fill with 0)
new_df['Score'] = new_df['Score'].fillna(0)

In [131]:
import numpy as np

In [132]:
conditions = [
    (new_df['Score'] >= 85),
    (new_df['Score'].between(70, 84)),
    (new_df['Score'] < 70)
]
choices = ['High', 'Medium', 'Low']
new_df['Score_Category'] = np.select(conditions, choices, default='Unknown')

# Verify
print(new_df['Score_Category'].value_counts())
print(new_df[['Name', 'Score', 'Score_Category']])

Score_Category
High      5
Medium    3
Low       2
Name: count, dtype: int64
      Name  Score Score_Category
5    Frank   75.0         Medium
1      Bob   78.0         Medium
7   Hannah   80.0         Medium
0    Alice   85.0           High
9     Jack   87.0           High
4      Eve   88.0           High
8      Ivy   90.0           High
3    David   92.0           High
2  Charlie    0.0            Low
6    Grace    0.0            Low

In [133]:
# pd.cut is a pandas function used to segment and sort data values into discrete bins.
# It is often used to convert continuous numerical data into categorical data.

# Example usage:
scores = [55, 65, 75, 85, 95]
bins = [0, 60, 70, 80, 100]
labels = ['Fail', 'Pass', 'Good', 'Excellent']

categories = pd.cut(scores, bins=bins, labels=labels)
print(categories)

['Fail', 'Pass', 'Good', 'Excellent', 'Excellent']
Categories (4, object): ['Fail' < 'Pass' < 'Good' < 'Excellent']

 Grouping and Aggregation in Pandas

In [134]:
df

   ID     Name   Age Grade  Subject  Score
5   6    Frank  22.0     B     Math   75.0
1   2      Bob   NaN     B  Science   78.0
7   8   Hannah   NaN     C  Science   80.0
0   1    Alice  20.0     A     Math   85.0
9  10     Jack  21.0     A  English   87.0
4   5      Eve  20.0   NaN  Science   88.0
8   9      Ivy  20.0     B     Math   90.0
3   4    David  21.0     A  English   92.0
2   3  Charlie  19.0     C     Math    NaN
6   7    Grace  19.0     A  English    NaN

In [135]:
mean_score_by_subject = df.groupby('Subject')['Score'].mean()
print(mean_score_by_subject)
print()

Subject
English    89.500000
Math       83.333333
Science    82.000000
Name: Score, dtype: float64

In [136]:
student_count_by_grade = df.groupby('Grade')['ID'].count()
print(student_count_by_grade)
print()

Grade
A    4
B    3
C    2
Name: ID, dtype: int64

C:\Users\ATHARV\AppData\Local\Temp\ipykernel_2932\22053159.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  student_count_by_grade = df.groupby('Grade')['ID'].count()

In [137]:
score_agg_by_subject = df.groupby('Subject')['Score'].agg(['mean', 'max'])
print(score_agg_by_subject)
print()

              mean   max
Subject
English  89.500000  92.0
Math     83.333333  90.0
Science  82.000000  88.0

In [138]:
print("Task 2b: Average Age by Subject and Grade")
avg_age_by_subject_grade = df.groupby(['Subject', 'Grade'])['Age'].mean()
print(avg_age_by_subject_grade)
print()

Task 2b: Average Age by Subject and Grade
Subject  Grade
English  A        20.333333
         B              NaN
         C              NaN
Math     A        20.000000
         B        21.000000
         C        19.000000
Science  A              NaN
         B              NaN
         C              NaN
Name: Age, dtype: float64

C:\Users\ATHARV\AppData\Local\Temp\ipykernel_2932\3244898273.py:2: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  avg_age_by_subject_grade = df.groupby(['Subject', 'Grade'])['Age'].mean()

In [139]:
print("Task 3a: Rows where Subject is 'Math'")
math_group = df.groupby('Subject').get_group('Math')
print(math_group)
print()

Task 3a: Rows where Subject is 'Math'
   ID     Name   Age Grade Subject  Score
5   6    Frank  22.0     B    Math   75.0
0   1    Alice  20.0     A    Math   85.0
8   9      Ivy  20.0     B    Math   90.0
2   3  Charlie  19.0     C    Math    NaN

In [140]:
print("Task 3b: Number of Rows per Subject")
subject_counts = df.groupby('Subject').size()
print(subject_counts)

Task 3b: Number of Rows per Subject
Subject
English    3
Math       4
Science    3
dtype: int64

In [141]:
import pandas as pd
contact_data = {
    'ID': [1, 3, 5, 11],
    'Email': ['alice@university.com', 'charlie@university.com', 'eve@university.com', 'john@university.com']
}
contact_df = pd.DataFrame(contact_data)

In [142]:
# Merge the two DataFrames on ID using an inner join and print the result.

pd.merge(df,contact_df,on='ID',how='inner')

   ID     Name   Age Grade  Subject  Score                   Email
0   1    Alice  20.0     A     Math   85.0    alice@university.com
1   5      Eve  20.0   NaN  Science   88.0      eve@university.com
2   3  Charlie  19.0     C     Math    NaN  charlie@university.com

In [143]:
pd.merge(df,contact_df,how='left')

   ID     Name   Age Grade  Subject  Score                   Email
0   6    Frank  22.0     B     Math   75.0                     NaN
1   2      Bob   NaN     B  Science   78.0                     NaN
2   8   Hannah   NaN     C  Science   80.0                     NaN
3   1    Alice  20.0     A     Math   85.0    alice@university.com
4  10     Jack  21.0     A  English   87.0                     NaN
5   5      Eve  20.0   NaN  Science   88.0      eve@university.com
6   9      Ivy  20.0     B     Math   90.0                     NaN
7   4    David  21.0     A  English   92.0                     NaN
8   3  Charlie  19.0     C     Math    NaN  charlie@university.com
9   7    Grace  19.0     A  English    NaN                     NaN

In [144]:
df.set_index('ID', inplace=True)
contact_df.set_index('ID', inplace=True)


joined_df = df.join(contact_df, how='inner')
print(joined_df)

       Name   Age Grade  Subject  Score                   Email
ID
1     Alice  20.0     A     Math   85.0    alice@university.com
5       Eve  20.0   NaN  Science   88.0      eve@university.com
3   Charlie  19.0     C     Math    NaN  charlie@university.com

In [145]:
import pandas as pd

# Load student_data.csv programmatically
student_data = {
    'ID': [1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve', 'Frank', 'Grace', 'Hannah', 'Ivy', 'Jack'],
    'Age': [20, None, 19, 21, 20, 22, 19, None, 20, 21],
    'Grade': ['A', 'B', 'C', 'A', None, 'B', 'A', 'C', 'B', 'A'],
    'Subject': ['Math', 'Science', 'Math', 'English', 'Science', 'Math', 'English', 'Science', 'Math', 'English'],
    'Score': [85, 78, None, 92, 88, 75, None, 80, 90, 87]
}
df_students = pd.DataFrame(student_data)

# Load student_contact.csv programmatically
contact_data = {
    'ID': [1, 3, 5, 11],
    'Email': ['alice@university.com', 'charlie@university.com', 'eve@university.com', 'john@university.com']
}
df_contacts = pd.DataFrame(contact_data)

# Task 1: Vertically concatenate student_data.csv with its first 3 rows
print("Task 1: Vertical Concatenation with First 3 Rows")
subset_df = df_students.iloc[:3]  # Select first 3 rows
vertical_concat_df = pd.concat([df_students, subset_df], axis=0, ignore_index=True)
print(vertical_concat_df)
print()

# Task 2: Horizontally concatenate student_data.csv and student_contact.csv
print("Task 2: Horizontal Concatenation with Compatible Indices")
# Set ID as index for both DataFrames
df_students_indexed = df_students.set_index('ID')
df_contacts_indexed = df_contacts.set_index('ID')
# Perform horizontal concatenation
horizontal_concat_df = pd.concat([df_students_indexed, df_contacts_indexed], axis=1)
print(horizontal_concat_df)

Task 1: Vertical Concatenation with First 3 Rows
    ID     Name   Age Grade  Subject  Score
0    1    Alice  20.0     A     Math   85.0
1    2      Bob   NaN     B  Science   78.0
2    3  Charlie  19.0     C     Math    NaN
3    4    David  21.0     A  English   92.0
4    5      Eve  20.0  None  Science   88.0
5    6    Frank  22.0     B     Math   75.0
6    7    Grace  19.0     A  English    NaN
7    8   Hannah   NaN     C  Science   80.0
8    9      Ivy  20.0     B     Math   90.0
9   10     Jack  21.0     A  English   87.0
10   1    Alice  20.0     A     Math   85.0
11   2      Bob   NaN     B  Science   78.0
12   3  Charlie  19.0     C     Math    NaN

Task 2: Horizontal Concatenation with Compatible Indices
       Name   Age Grade  Subject  Score                   Email
ID
1     Alice  20.0     A     Math   85.0    alice@university.com
2       Bob   NaN     B  Science   78.0                     NaN
3   Charlie  19.0     C     Math    NaN  charlie@university.com
4     David  21.0     A  English   92.0                     NaN
5       Eve  20.0  None  Science   88.0      eve@university.com
6     Frank  22.0     B     Math   75.0                     NaN
7     Grace  19.0     A  English    NaN                     NaN
8    Hannah   NaN     C  Science   80.0                     NaN
9       Ivy  20.0     B     Math   90.0                     NaN
10     Jack  21.0     A  English   87.0                     NaN
11      NaN   NaN   NaN      NaN    NaN     john@university.com

Reshaping Data in Pandas

Pivoting

In [146]:
pivotdf=df.pivot(index='Name',columns='Subject',values='Score')
print(pivotdf)

Subject  English  Math  Science
Name
Alice        NaN  85.0      NaN
Bob          NaN   NaN     78.0
Charlie      NaN   NaN      NaN
David       92.0   NaN      NaN
Eve          NaN   NaN     88.0
Frank        NaN  75.0      NaN
Grace        NaN   NaN      NaN
Hannah       NaN   NaN     80.0
Ivy          NaN  90.0      NaN
Jack        87.0   NaN      NaN

In [147]:
pivot_table_df = df.pivot_table(index='Subject', columns='Grade', values='Score', aggfunc='mean')
print("Pivot Table: Average Score by Subject and Grade")
print(pivot_table_df)

Pivot Table: Average Score by Subject and Grade
Grade       A     B     C
Subject
English  89.5   NaN   NaN
Math     85.0  82.5   NaN
Science   NaN  78.0  80.0

C:\Users\ATHARV\AppData\Local\Temp\ipykernel_2932\3840100123.py:1: FutureWarning: The default value of observed=False is deprecated and will change to observed=True in a future version of pandas. Specify observed=False to silence this warning and retain the current behavior
  pivot_table_df = df.pivot_table(index='Subject', columns='Grade', values='Score', aggfunc='mean')

In [149]:
print(df.columns)

Index(['Name', 'Age', 'Grade', 'Subject', 'Score'], dtype='object')

In [151]:
melted_Df=pd.melt(df,id_vars=['Grade','Name'],value_vars=['Score','Age'])
melted_Df

   Grade     Name variable  value
0      B    Frank    Score   75.0
1      B      Bob    Score   78.0
2      C   Hannah    Score   80.0
3      A    Alice    Score   85.0
4      A     Jack    Score   87.0
5    NaN      Eve    Score   88.0
6      B      Ivy    Score   90.0
7      A    David    Score   92.0
8      C  Charlie    Score    NaN
9      A    Grace    Score    NaN
10     B    Frank      Age   22.0
11     B      Bob      Age    NaN
12     C   Hannah      Age    NaN
13     A    Alice      Age   20.0
14     A     Jack      Age   21.0
15   NaN      Eve      Age   20.0
16     B      Ivy      Age   20.0
17     A    David      Age   21.0
18     C  Charlie      Age   19.0
19     A    Grace      Age   19.0

In [152]:
stacked_df = df[['Name', 'Subject', 'Score']].set_index('Name').stack()
print("Stacked DataFrame (Long Format):")
print(stacked_df)

Stacked DataFrame (Long Format):
Name
Frank    Subject       Math
         Score         75.0
Bob      Subject    Science
         Score         78.0
Hannah   Subject    Science
         Score         80.0
Alice    Subject       Math
         Score         85.0
Jack     Subject    English
         Score         87.0
Eve      Subject    Science
         Score         88.0
Ivy      Subject       Math
         Score         90.0
David    Subject    English
         Score         92.0
Charlie  Subject       Math
Grace    Subject    English
dtype: object

In [ ]:
# #Applying Functions to Series:
# Use df['column'].apply(func) to apply a function to each element in a column.
# Example: df['Score'].apply(lambda x: x + 10) adds 10 to each score.
# Applying Functions to DataFrame:
# Use df.apply(func, axis=0) for column-wise operations or axis=1 for row-wise operations.
# Example: df.apply(lambda row: row['Score'] * 2, axis=1) doubles scores row-wise.
# Vectorized Operations:
# Use vectorized methods like df['column'].map(dict) for mapping values or np.where for conditional logic.
# Example: df['Grade'].map({'A': 4, 'B': 3, 'C': 2}) converts grades to numeric values.

Time Series Data in Pandas

In [168]:
data = {
    'ID': [1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve', 'Frank', 'Grace', 'Hannah', 'Ivy', 'Jack'],
    'Age': [20, None, 19, 21, 20, 22, 19, None, 20, 21],
    'Grade': ['A', 'B', 'C', 'A', None, 'B', 'A', 'C', 'B', 'A'],
    'Subject': ['Math', 'Science', 'Math', 'English', 'Science', 'Math', 'English', 'Science', 'Math', 'English'],
    'Score': [85, 78, None, 92, 88, 75, None, 80, 90, 87],
    'Exam_Date': ['2023-01-10', '2023-01-15', '2023-02-01', '2023-02-10', '2023-03-01', '2023-03-15', '2023-04-01', '2023-04-10', '2023-05-01', '2023-05-15']
}
df = pd.DataFrame(data)
df['Exam_Date'] = pd.to_datetime(df['Exam_Date'])

In [169]:
new_df = df.copy()
new_df

   ID     Name   Age Grade  Subject  Score  Exam_Date
0   1    Alice  20.0     A     Math   85.0 2023-01-10
1   2      Bob   NaN     B  Science   78.0 2023-01-15
2   3  Charlie  19.0     C     Math    NaN 2023-02-01
3   4    David  21.0     A  English   92.0 2023-02-10
4   5      Eve  20.0  None  Science   88.0 2023-03-01
5   6    Frank  22.0     B     Math   75.0 2023-03-15
6   7    Grace  19.0     A  English    NaN 2023-04-01
7   8   Hannah   NaN     C  Science   80.0 2023-04-10
8   9      Ivy  20.0     B     Math   90.0 2023-05-01
9  10     Jack  21.0     A  English   87.0 2023-05-15

In [171]:
new_df['Score'] = new_df['Score'].fillna(0)
new_df

   ID     Name   Age Grade  Subject  Score  Exam_Date
0   1    Alice  20.0     A     Math   85.0 2023-01-10
1   2      Bob   NaN     B  Science   78.0 2023-01-15
2   3  Charlie  19.0     C     Math    0.0 2023-02-01
3   4    David  21.0     A  English   92.0 2023-02-10
4   5      Eve  20.0  None  Science   88.0 2023-03-01
5   6    Frank  22.0     B     Math   75.0 2023-03-15
6   7    Grace  19.0     A  English    0.0 2023-04-01
7   8   Hannah   NaN     C  Science   80.0 2023-04-10
8   9      Ivy  20.0     B     Math   90.0 2023-05-01
9  10     Jack  21.0     A  English   87.0 2023-05-15

In [172]:
# Set Exam_Date as index and filter for first half of 2023
new_df = new_df.set_index('Exam_Date')
new_df = new_df['2023-01-01':'2023-06-30']
# Add Month_Name column
new_df['Month_Name'] = new_df.index.strftime('%B')

In [173]:
resampled_df = new_df.resample('M').agg({'ID': 'count', 'Score': 'mean'})
resampled_df = resampled_df.rename(columns={'ID': 'Exam_Count'})

C:\Users\ATHARV\AppData\Local\Temp\ipykernel_2932\1197162890.py:1: FutureWarning: 'M' is deprecated and will be removed in a future version, please use 'ME' instead.
  resampled_df = new_df.resample('M').agg({'ID': 'count', 'Score': 'mean'})

In [174]:
# Print the resulting DataFrame
print("Resampled DataFrame (Monthly Exam Count and Average Score):")
print(resampled_df)

# Explanation of Month_Name extraction
print("\nExplanation: The Month_Name column was created by extracting the full month name from the Exam_Date index using the strftime('%B') method, which formats the datetime index to display the month name (e.g., 'January' for 2023-01-10).")

Resampled DataFrame (Monthly Exam Count and Average Score):
            Exam_Count  Score
Exam_Date
2023-01-31           2   81.5
2023-02-28           2   46.0
2023-03-31           2   81.5
2023-04-30           2   40.0
2023-05-31           2   88.5

Explanation: The Month_Name column was created by extracting the full month name from the Exam_Date index using the strftime('%B') method, which formats the datetime index to display the month name (e.g., 'January' for 2023-01-10).